Repository: b0ric/wordxtract
Catalog: wordxtract/po/*.po
Languages: ru

source: WordXtract Preferences
ru: Настройки WordXtract

source: General
ru: Основные

source: Query on program exit
ru: Подтверждение при выходе из программы

source: <b>Words saving options</b>
ru: <b>Сохранение списка слов</b>

source: Columns:
ru: Колонки:

source: Specify how many columns will be in the saved list of the words
ru: Укажите количество колонок из слов, которое будет в сохраненном файле

source: Field langth:
ru: Ширина поля:

source: Specify length of one field (in symbols) in the saved list of the words
ru: Укажите ширину поля (в символах) которая будет предоставляться каждому слову в сохраняемом файле

source: Analyser
ru: Анализатор

source: Analyser language:
ru: Язык анализатора:

source: English
ru: Английский

source: Language of the text you want to analyse
ru: Язык текста который вы хотите проанализировать

source: Exclude words with cAPiTal letters
ru: Исключать слова с бОЛЬшИми буквами

source: Lower first capital in each sentence
ru: Делать прописной первую букву в предложении

source: <b>Quotes analysis</b>
ru: <b>Анализ слов с кавычками</b>

source: Exclude words with quotes
ru: Исключать слова с кавычками

source: Exclude 'quoted' words
ru: Исключать слова в 'кавычках'

source: Exclude words with 'quote in the beginning
ru: Исключать слова начинающиеся с 'кавычки

source: Exclude words with quo'te in the middle
ru: Исключать слова с кавы'чкой посередине

source: Exclude only part of the word after quo<s>'te</s>
ru: Исключать только слово после ка<s>'вычки</s>

source: Exclude words with quote' in the end
ru: Исключать слова с кавычкой' в конце

source: <b>Hyphen analysis</b>
ru: <b>Анализ слов с дефисом</b>

source: Exclude words with hyphens
ru: Исключать слова с дефисом

source: Exclude -hyphened- words
ru: Исключать слова в -дефисах-

source: Exclude words with -hyphen in the beginning
ru: Исключать слова начинающиеся с -дефиса

source: Exclude words with hy-phen in the middle
ru: Исключать слова с дефи-сом в середине

source: Exclude only part of the word after hy<s>-phen</s>
ru: Исключать только слово после де<s>-фиса</s>

source: Exclude words with hyphen- in the end
ru: Исключать слова с дефисом- в конце

source: WordXtract Dictionary
ru: Словарь WordXtract

source: Words in the dictionary:
ru: Слова в словаре:

source: Changes to the dictionary:
ru: Изменения словаря:

source: Add word:
ru: Добавить слово:

source: Add word to the dictionary
ru: Добавить слово в словарь

source: Discard changes and close the window
ru: Оменить изменения и закрыть окно

source: Apply changes and close the window
ru: Применить изменения и закрыть окно

source: <b> Words in the dictionary: %d</b>
ru: <b> Слов в словаре: %d</b>

source: Add from file
ru: Добавить из файла

source: Remove this word from the dictionary
ru: Удалить это слово из словаря

source: Clear the dictionary
ru: Очистить словарь

source: SubRip subtitles (*srt)
ru: Субтитры SubRip (*srt)

source: Plain text
ru: Текстовый файл

source: Open File to add words from it
ru: Откройте файл чтобы добавить слова из него...

source: <b>This word has been already marked to add!</b>
ru: <b>Это слово уже есть в списке!</b>

source: <b>This word is in the dictionary!</b>
ru: <b>Это слово уже есть в словаре!</b>

source: _File
ru: _Файл

source: Open file to analyse
ru: Открыть файл для анализа

source: Words
ru: Слова

source: Save list of words to file
ru: Сохранить список слов в файл

source: Text
ru: Текст

source: Save text from which words were picked up
ru: Сохранить текст из которого были выбраны слова

source: Close the program
ru: Закрыть программу

source: _Edit
ru: _Редактировать

source: Dictionary
ru: Словарь

source: View and edit dictionary
ru: Смотреть и редактировать словарь

source: Change application settings
ru: Изменить настройки приложения

source: _Help
ru: _Помощь

source: About the program
ru: О программе

source: Find:
ru: Искать:

source: Find word
ru: Найти слово

source: Previous word
ru: Предыдущее слово

source: Next word
ru: Следующее слово

source: Cleanup highlighting
ru: Убрать подсветку

source: Open file to pick up words from it...
ru: Откройте файл для сбора слов...

source: Welcome to WordXtract This is a program which helps to pick up list of unique words from any plain text or subtitle file. Currently parser supports only English language but it allows to adjust number of settings which may be suitable for other languages. Some words can be excluded according to list of words specified in your dictionary. Also it allows you to save processed text and list of words. You may find it more effective to work with translators like StarDict which allows to translate words "on the fly" by binding "hot key" for floating window. Enjoy!
ru: Добро пожаловать в WordXtract Это программа, которая поможет составить список слов, проанализировав текстовый файл или файл субтитров. На данный момент анализатор поддерживает только Английский язык, но у него есть ряд настроек, регулировка которых, возможно, сделает его подходящим и для других языков. Некоторые слова исключаются из списка если они уже есть в словаре. Также программа позволяет сохранять полученный текст и список слов в файл. Возможно Вам покажется более удобным работать совместно со словарями, подобными StarDict, которые позволяют быстро переводить слова во всплывающем окошке. Удачи!

source: SubRip subtitles (*.srt)
ru: Субтитры SubRip (*.srt)

source: Text files (*.txt)
ru: Текстовые файлы (*.txt)

source: Open File for analysing
ru: Открыть файл для анализа

source: %d words were picked up from '%s'
ru: %d слов было выбрано из файла '%s'

source: Save list of words as...
ru: Сохранить список слов как...

source: Save text as...
ru: Сохранить текст как...

source: Failed to open URI: %s
ru: Ошибка открытия URI: %s

source: WordXtract is a text and subtitle parser which shows list of unique words from the file.
ru: WordXtract - программа для анализа субтитров и текстовых файлов которая создает список уникальных слов из данного файла.

source: ru: Borisov Alexandr <b0ric.alex@gmail.com>
ru: ru: Борисов Алексадр <b0ric.alex@gmail.com>

source: Search word
ru: Искать слово

source: Show sentenses word appears in
ru: Показать предложения где встречается слово

source: Add to the dictionary
ru: Добавить слово в словарь

source: Word '%s' was not found
ru: Слово '%s' было не найдено

source: Error
ru: Ошибка

source: Warning
ru: Внимание

source: Confirmation
ru: Подтверждение

source: Could not open file
ru: Невозможно открыть файл

source: Could not save words to file
ru: Невозможно сохранить слова в файл

source: Could not save text to file
ru: Невозможно сохранить текст в файл

source: File you've chosen contains non UTF-8 characters. Result can be unpredictable!
ru: В выбранном вами файле содержатся не UTF-8 символы. Результат может быть непредсказуемым!

source: Are you sure to exit?
ru: Вы действительно желаете выйти?

source: Pick up list of unique words from file
ru: Создать список уникальных слов из файла
